Tekla Open API Reference for Tekla Structures 2025
PluginPickerInput Constructor (List<PickerInput>)
 Initializes a new instance of the PluginPickerInput class which contains a predefined sequence of inputs.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public PluginPickerInput(
	List<PickerInput> inputs
)
Public Sub New (
	inputs As List(Of PickerInput)
)
Parameters
inputs
Type: System.Collections.Generic.List<PickerInput>
The sequence of picker inputs.
See Also
Reference
PluginPickerInput Class
PluginPickerInput Overload
Tekla.Structures.Drawing Namespace